#include <iostream>//判断是几位数，并依次输入各位数上的数字
using namespace std;
int main(){
    int x;
    cin>>x;
    if(x<100000)
    {
    if((x<10)&&(x>0))
    cout<<"1:"<<x<<endl;
    else if((x<100)&&(x>=10))
    cout<<"10:"<<(x/10)<<" "<<"1:"<<(x%10)<<endl;//如何取每一位的数字
    else if((x<1000)&&(x>=100))
    cout<<"100:"<<(x/100)<<" "<<"10:"<<((x%100)/10)<<" "<<"1:"<<(x%10);
    else if((x<1e+4)&&(x>=1000))
    cout<<"1000:"<<(x/1000)<<" "<<"100:"<<((x%1000)/100)<<" "<<"10:"<<((x%100)/10)<<" "<<"1:"<<(x%10);
    else if((x<1e+5)&&(x>=1e+4))
    cout<<"10000:"<<(x/10000)<<" "<<"1000:"<<((x%10000)/1000)<<" "<<"100:"<<((x%1000)/100)<<" "<<"10:"<<((x%100)/10)<<" "<<"1:"<<(x%10);
    }
    else cout<<"a bad number"<<endl;
    return 0;
}